/****************************************************************
数据结构

1、线性表
	1）顺序表（动态存储）	(ok)

	2）链式存储
		a.单向链表	(ok)
		b.双向链表	(ok)
		c.循环链表

2、栈
	1）顺序栈（动态存储）	(ok)

	2）链栈（单向链栈）	(ok)

3、队列
	1）顺序队列（动态存储，循环队列）	(ok)

	2）单链队列	(ok)

4、数组
	1）顺序存储

5、稀疏矩阵
	1）顺序存储（三元组）

	2）链式存储（十字链表）

6、广义表
	1）链式存储
		a.头尾链表
		b.可扩展性链表

7、二叉树
	1）顺序存储

	2）二叉链表

8、遍历二叉树

9、线索二叉树

10、树
	1）链式存储
	a.双亲表示法
	b.孩子表示法
	c.孩子兄弟表示法

11、赫夫曼树和赫夫曼编码

12、图
	1）邻接矩阵

	2）邻接表

	3）十字链表

	4）邻接多重表

13、图的操作
	1）遍历
		a.深度优先
		b.广度优先

	2）生成树（最小生成树）
		a.普里姆算法
		b.克鲁斯卡尔算法

	3）最短路径
		a.迪杰斯特拉算法
		b.弗洛伊德算法

	4）拓扑排序
		a.AOV网
		b.拓扑排序算法

	4）关键路径
		a.AOE网
		b.关键路径算法

14、排序
	1）插入排序
		a.直接插入排序	()
		b.折半插入排序
		c.希尔排序	()

	2）交换排序
		a.起泡排序
		b.快速排序	()

	3）选择排序
		a.简单（直接）选择排序	()
		b.树形选择排序
		c.堆排序	()

	4）归并排序	()

	5）基数排序	()

	6）外部排序
		
15、查找
	1）静态查找
		a.顺序表（顺序查找）	()
		b.有序表（折半查找）
		c.静态树表
		d.索引顺序表（索引查找）

	2）动态查找
		a.二叉排序树和平衡二叉树
		b.B-和B+树
		c.键树

	3）哈希表
		哈希查找




****************************************************************/